In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame({'groups':['X','Y','Z','X','Y','Z'],
                  'VAL1':[2,5,25,45,56,69],
                  'VAL2':[92,245,10,96,259,369]})

In [4]:
df

  groups  VAL1  VAL2
0      X     2    92
1      Y     5   245
2      Z    25    10
3      X    45    96
4      Y    56   259
5      Z    69   369

In [5]:
df.groupby("groups").mean()

        VAL1   VAL2
groups
X       23.5   94.0
Y       30.5  252.0
Z       47.0  189.5

In [6]:
df.groupby("groups").aggregate(["mean",np.median, min,"sum"])

        VAL1                  VAL2
        mean median min sum   mean median  min  sum
groups
X       23.5   23.5   2  47   94.0   94.0   92  188
Y       30.5   30.5   5  61  252.0  252.0  245  504
Z       47.0   47.0  25  94  189.5  189.5   10  379

In [7]:
df.groupby("groups").aggregate({"VAL1": "mean", "VAL2":"median"})

        VAL1   VAL2
groups
X       23.5   94.0
Y       30.5  252.0
Z       47.0  189.5

In [9]:
def example_fun(x):
    return x["VAL2"].mean() < 200

In [10]:
df.groupby("groups").filter(example_fun)

  groups  VAL1  VAL2
0      X     2    92
2      Z    25    10
3      X    45    96
5      Z    69   369

In [11]:
df_new = df.loc[:,"VAL1":"VAL2"]

In [12]:
df_new

   VAL1  VAL2
0     2    92
1     5   245
2    25    10
3    45    96
4    56   259
5    69   369

In [16]:
def norm(x):
    return (x- x.min()) / (x.max()-x.min())

In [17]:
df_new.transform(norm)

       VAL1      VAL2
0  0.000000  0.228412
1  0.044776  0.654596
2  0.343284  0.000000
3  0.641791  0.239554
4  0.805970  0.693593
5  1.000000  1.000000

In [18]:
df

  groups  VAL1  VAL2
0      X     2    92
1      Y     5   245
2      Z    25    10
3      X    45    96
4      Y    56   259
5      Z    69   369

In [19]:
df.apply(np.sum)

groups    XYZXYZ
VAL1         202
VAL2        1071
dtype: object

In [20]:
df.apply(np.mean)

TypeError: Could not convert XYZXYZ to numeric

In [21]:
df_new

   VAL1  VAL2
0     2    92
1     5   245
2    25    10
3    45    96
4    56   259
5    69   369

In [23]:
df_new.apply(np.mean)

VAL1     33.666667
VAL2    178.500000
dtype: float64

In [26]:
df_new.apply(np.mean,axis=1)

0     47.0
1    125.0
2     17.5
3     70.5
4    157.5
5    219.0
dtype: float64

In [27]:
df.groupby("groups").apply(np.mean)

C:\Users\hp\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\hp\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

        VAL1   VAL2
groups
X       23.5   94.0
Y       30.5  252.0
Z       47.0  189.5

In [28]:
def cube(x):
    return x **3

In [29]:
df_new

   VAL1  VAL2
0     2    92
1     5   245
2    25    10
3    45    96
4    56   259
5    69   369

In [30]:
df_new.apply(cube)

     VAL1      VAL2
0       8    778688
1     125  14706125
2   15625      1000
3   91125    884736
4  175616  17373979
5  328509  50243409

In [31]:
df_new.VAL1.apply(cube)

0         8
1       125
2     15625
3     91125
4    175616
5    328509
Name: VAL1, dtype: int64